INSERT INTO libraryy.reader ("name", "surname", "patronymic", "card_date",
                    "date_of_birth", "address", "phone_number") VALUES
                ('Полина', 'Петрова','Андреевна', '2020-01-01'::date,
                 '1978-05-12'::date, 'Москва Раменки д1', 89123432),
                ('Анна', 'Буринкова','Алексеевна', '2020-01-01'::date,
                 '1988-06-14'::date, 'Москва Ховено д22', 89123232),
                ('Лёша', 'Шамилев','Петрович', '2020-01-01'::date,
                 '1979-03-16'::date, 'Новгород Волховская д12', 89154329),
                ('Вирджиния', 'Сибиркин','Сергеевна', '2020-01-01'::date,
                 '1981-02-02'::date, 'Петербург Кочетово д2', 8834847),
                ('Ева', 'Лисакова','Сергеевна', '2020-01-01'::date,
                 '1997-08-22'::date, 'Новгород Державина д4', 88493732),
                 ('Ева', 'Белкина','Сергеевна', '2020-01-01'::date,
                  '1997-08-22'::date, 'Новгород Державина д4', 88493732);

INSERT INTO libraryy.books ("name", "author", "publishing_house", "amount",
                   "about", "genre", "date_of_receiving") VALUES
                  ('Мертвые души', 'Гоголь', 'Синяя птица', 10,
                   'Сюжет', 'хоррор', '2020-01-01'::date),
                  ('Ёжик в тумане', 'Пришвин', 'Солнце', 10,
                   'Книга про ёжика', 'мелодрама', '2020-01-01'::date),
                  ('Над пропастью во ржи', 'Сэлинджер', 'Тайм', 10,
                   'Книга про приключения подростка', 'рассказ', '2020-01-01'::date),
                  ('Живаго', 'Пастернак', 'Новый мир', 10, 'Книга про доктора', 'детектив', '2020-01-01'::date),
                  ('О чём говорят птицы', 'Можвик', 'Солнце', 10,
                   'Книга про птиц', 'рассказ', '2020-01-01'::date),
                  ('А в море корабли..', 'Данкин', 'путешествия', 5, 'Книга про путешествия на короблях',
                   'роман', '21-04-2023'::date);

INSERT INTO libraryy.book_copy ("book_id", "is_taken_now") VALUES
      (1,  'No'), (1,  'No'), (1,  'No'), (1,  'No'), (1,  'No'), (1,  'No'), (1,  'No'), (1,  'No'), (1,  'No'), (1,  'No'),
      (2,  'No'), (2,  'No'), (2,  'No'), (2,  'No'), (2,  'No'), (2,  'No'), (2,  'No'), (2,  'No'), (2,  'No'), (2,  'No'),
      (3,  'No'), (3,  'No'), (3,  'No'), (3,  'No'), (3,  'No'), (3,  'No'), (3,  'No'), (3,  'No'), (3,  'No'), (3,  'No'),
      (4,  'No'), (4,  'No'), (4,  'No'), (4,  'No'), (4,  'No'), (4,  'No'), (4,  'No'), (4,  'No'), (4,  'No'), (4,  'No'),
      (5,  'No'), (5,  'No'), (5,  'No'), (5,  'No'), (5,  'No'), (5,  'No'), (5,  'No'), (5,  'No'), (5,  'No'), (5,  'No'),
      (6,  'No'), (6,  'No'), (6,  'No'), (6,  'No'), (6,  'No');

INSERT INTO libraryy.records ("reader_id", "copy_id", "taking_date", "returning_date") VALUES
              (1000001, 1, '2021-01-01'::date, '2021-02-01'::date),
              (1000002, 2, '2021-01-01'::date, '2021-02-01'::date),
              (1000003, 3, '2021-01-01'::date, '2021-02-01'::date),
              (1000004, 4, '2021-01-01'::date, '2021-02-01'::date),
              (1000005, 5, '2021-01-01'::date, '2021-02-01'::date),
              (1000001, 11, '2021-01-01'::date, '2021-02-01'::date),
              (1000002, 12, '2021-01-01'::date, '2021-02-01'::date),
              (1000003, 13, '2021-01-01'::date, '2021-02-01'::date),
              (1000004, 14, '2021-01-01'::date, '2021-02-01'::date),
              (1000005, 15, '2021-01-01'::date, '2021-02-01'::date),
              (1000001, 21, '2021-01-01'::date, '2021-02-01'::date),
              (1000002, 22, '2021-01-01'::date, '2021-02-01'::date),
              (1000003, 23, '2021-01-01'::date, '2021-02-01'::date),
              (1000004, 24, '2021-01-01'::date, '2021-02-01'::date),
              (1000005, 25, '2021-01-01'::date, '2021-02-01'::date),
              (1000001, 31, '2021-01-01'::date, '2021-02-01'::date),
              (1000002, 32, '2021-01-01'::date, '2021-02-01'::date),
              (1000003, 33, '2021-01-01'::date, '2021-02-01'::date),
              (1000004, 34, '2021-01-01'::date, '2021-02-01'::date),
              (1000005, 35, '2021-01-01'::date, '2021-02-01'::date),
              (1000006, 52, '2021-01-01'::date, '2021-02-01'::date);


